app/controllers/tags_controller.rb

  def index
      @tags = User.tag_counts_on(:interests).where("name like ?", "%#{params[:q]}%").map(&:name)
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN users ON users.id = taggings.taggable_id WHERE (taggings.taggable_type = 'User' AND taggings.context = 'interests') AND (taggings.taggable_id IN(SELECT users.id FROM "users" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE (name like ''%v%'')