app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'tim@tim.com' LIMIT 1
---
  def create_message
    @to = User.find_by_email(params[:acts_as_messageable_message][:to])