app/controllers/users_controller.rb

  def index
    @users = User.where(gender: current_user.get_preference).page(params[:page]).per(12)
---
SELECT "users".* FROM "users" WHERE "users"."gender" IN ('male', 'female')
SELECT COUNT(*) FROM "users" WHERE "users"."gender" = 'female'

  def search

    if params['distance'].blank?
      @users =  User.where(gender: current_user.get_preference).page(params[:page]).per(12)
    else
      @users = current_user.nearbys(params[:distance]).where(gender: current_user.get_preference).page(params[:page]).per(12)
    end

    unless params['interest_list'].blank?
      @users = @users.tagged_with(params['interest_list']).page(params[:page]).per(12)
---
SELECT COUNT(*) FROM "users" WHERE "users"."gender" = 'female' AND (users.latitude BETWEEN 50.681088441067935 AND 52.07051355893207 AND users.longitude BETWEEN -3.472851440275833 AND -1.246956359724167 AND users.id != 50)
SELECT users.*, (69.09332411348201 * ABS(users.latitude - 52.95478319999999) * 0.7071067811865475) + (59.836573914187355 * ABS(users.longitude - -1.1581086) * 0.7071067811865475) AS distance, CASE WHEN (users.latitude >= 52.95478319999999 AND users.longitude >= -1.1581086) THEN 45.0 WHEN (users.latitude < 52.95478319999999 AND users.longitude >= -1.1581086) THEN 135.0 WHEN (users.latitude < 52.95478319999999 AND users.longitude < -1.1581086) THEN 225.0 WHEN (users.latitude >= 52.95478319999999 AND users.longitude < -1.1581086) THEN 315.0 END AS bearing FROM "users" WHERE "users"."gender" IN ('male', 'female') AND (users.latitude BETWEEN 48.612829706674546 AND 57.29673669332543 AND users.longitude BETWEEN -8.36532708522509 AND 6.04910988522509 AND users.id != 40) AND (1 = 0) ORDER BY distance ASC
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'lego building' OR lower(name) = 'amateur radio')
SELECT COUNT(*) FROM "users" JOIN taggings users_taggings_e8d7c42 ON users_taggings_e8d7c42.taggable_id = users.id AND users_taggings_e8d7c42.taggable_type = 'User' AND users_taggings_e8d7c42.tag_id = 2 JOIN taggings users_taggings_9fea926 ON users_taggings_9fea926.taggable_id = users.id AND users_taggings_9fea926.taggable_type = 'User' AND users_taggings_9fea926.tag_id = 4 WHERE "users"."gender" = 'female'
SELECT users.*, (69.09332411348201 * ABS(users.latitude - 52.95478319999999) * 0.7071067811865475) + (59.836573914187355 * ABS(users.longitude - -1.1581086) * 0.7071067811865475) AS distance, CASE WHEN (users.latitude >= 52.95478319999999 AND users.longitude >= -1.1581086) THEN 45.0 WHEN (users.latitude < 52.95478319999999 AND users.longitude >= -1.1581086) THEN 135.0 WHEN (users.latitude < 52.95478319999999 AND users.longitude < -1.1581086) THEN 225.0 WHEN (users.latitude >= 52.95478319999999 AND users.longitude < -1.1581086) THEN 315.0 END AS bearing FROM "users" JOIN taggings users_taggings_319320c ON users_taggings_319320c.taggable_id = users.id AND users_taggings_319320c.taggable_type = 'User' AND users_taggings_319320c.tag_id = 9 WHERE "users"."gender" IN ('male', 'female') AND (users.latitude BETWEEN 52.95478319999999 AND 52.95478319999999 AND users.longitude BETWEEN -1.1581086 AND -1.1581086 AND users.id != 40) ORDER BY distance ASC